<a href="https://colab.research.google.com/github/0257chaitanyaprasad/python-new/blob/module-3/Untitled2_(4).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
## Printing a CSV file
import pandas as pd

df = pd.read_csv('C:\\Users\ckund\Downloads\C Notes\sample.csv')

print(df.to_string())

   Sno     Name  Marks
0    1   Chaitu     93
1    2  aravind     90
2    3    Suraj     97
3    4    Kiran     98

In [ ]:
import pandas
mydataset = {'session': ["morning", "afternoon", "night"],'number of kgs': [25,30,45]}
myvar = pandas.DataFrame(mydataset)
print(myvar)

     session  number of kgs
0    morning             25
1  afternoon             30
2      night             45

In [ ]:
import pandas as pd
print(pd.__version__)

1.3.4

In [ ]:
import pandas as pd
a = [2,85.45]
b = pd.Series(a)
print(b)

0     2.00
1    85.45
dtype: float64

In [ ]:
print(b[0])

2.0

In [ ]:
import pandas as pd
a = ['chaitu','aravind','bhagyesh']
b = pd.Series(a, index = ['1','2','3'])
print(b)

1      chaitu
2     aravind
3    bhagyesh
dtype: object

In [ ]:
print(b["2"])

aravind

In [ ]:
import pandas as pd
a = {'morning':'35', 'afternoon':'45','night':'55'}
print(pd.Series(a))

morning      35
afternoon    45
night        55
dtype: object

In [ ]:
import pandas as pd
df = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\sample.csv')
new_file = df.dropna()
print(new_file.to_string)

<bound method DataFrame.to_string of    Sno     Name  Marks
0    1   Chaitu   93.0
1    2  aravind   90.0
2    3    Suraj   97.0
3    4    Kiran   98.0>

In [ ]:
import pandas as pd
df = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\info.csv')
df.fillna(95, inplace = True)
print(df.to_string())

   Sno      Name  Marks
0    1    Chaitu   93.0
1    2   Aravind   90.0
2    3     Suraj   97.0
3    4     Kiran   98.0
4    5  Bhagyesh   95.0

In [ ]:
import pandas as pd
df = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\CSK.csv')
for x in df.index:
  if df.loc[x, "score"] == 95:
    df.loc[x, "score"] = 98
print(df.to_string())

   Sno     Name  score
0    1   Dhoni     100
1    2   Rayudu     75
2    3   Jadeja     98
3    4   Conway     93
4    5  Ruturaj    100

In [ ]:
import pandas as pd
df = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\dob.csv')
df['DOB'] = pd.to_datetime(df['DOB'])
print(df.to_string())

   SNO     Names        DOB
0     1   Manasa 2003-10-10
1     2   Chaitu 2004-05-17
2     3  Aravind 2003-06-25

In [ ]:
import pandas as pd
a = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\Data.csv')
b = pd.DataFrame(a)
print(b)

    sno        Name  Age   Mobile No         Mail     Password
0     1      Chaitu   18  8106940122  **@gitam.in   **********
1     2     Aravind   19  7654286963  **@gitam.in     ********
2     3    Bhagyesh   19  8479658997  **@gitam.in        *****
3     4       Pavan   18  8456921775  **@gitam.in      *******
4     5   Sai kiran   20  9345865744  **@gitam.in     ********
5     6       Kiran   19  7658459658  **@gitam.in     ********
6     7       Suraj   18  9548678954  **@gitam.in      *******
7     8      Pranav   19  7895469542  **@gitam.in       ******
8     9    Naga Sai   20  8899774455  **@gitam.in      *******
9    10    Srikanth   19  7788990011  **@gitam.in     ********
10   11       Subbu   20  9988776655  **@gitam.in     ********
11   12      Harsha   20  9554864815  **@gitam.in     ********
12   13  Bharathwaj   19  9785432158  **@gitam.in  ***********
13   14      Nithin   19  7895525559  **@gitam.in      *******
14   15     Karthik   18  7854695502  **@gitam.in     ********
15   16       Bhanu   19  7894561256  **@gitam.in    *********
16   17     Dhanush   19  8546297615  **@gitam.in     ********
17   18        Yash   19  7849569314  **@gitam.in     ********
18   19       Sunil   20  7858995995  **@gitam.in        *****
19   20       Viswa   19  7889468125  **@gitam.in     ********
20   21  Karthikeya   20  7899546895  **@gitam.in    *********

In [ ]:
import pandas as pd
a = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\Data.csv')
a[:10]
a.aggregate({'Age':['min','max']})

     Age
min   18
max   20

In [ ]:
import pandas as pd
a = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\Data.csv')
a[:10]
a.aggregate({'Mobile No':['min','max']})

      Mobile No
min  7654286963
max  9988776655

In [ ]:
import pandas as pd
a = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\Data.csv')
a[:10]

   sno       Name  Age   Mobile No         Mail    Password
0    1     Chaitu   18  8106940122  **@gitam.in  **********
1    2    Aravind   19  7654286963  **@gitam.in    ********
2    3   Bhagyesh   19  8479658997  **@gitam.in       *****
3    4      Pavan   18  8456921775  **@gitam.in     *******
4    5  Sai kiran   20  9345865744  **@gitam.in    ********
5    6      Kiran   19  7658459658  **@gitam.in    ********
6    7      Suraj   18  9548678954  **@gitam.in     *******
7    8     Pranav   19  7895469542  **@gitam.in      ******
8    9   Naga Sai   20  8899774455  **@gitam.in     *******
9   10   Srikanth   19  7788990011  **@gitam.in    ********

In [ ]:
import pandas as pd
a = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\Data.csv')
a[:10]
a.aggregate({'Age':['sum','average']})

                Age
sum      401.000000
average   19.095238

In [ ]:
import pandas as pd
a = pd.read_csv('C:\\Users\ckund\OneDrive\Desktop\Data.csv')
a[:10]
a.aggregate({'Mobile No':['sum','average']})

            Mobile No
sum      1.768528e+11
average  8.421561e+09

In [ ]:
import pandas as vk
a = a.groupby(['Mobile No','Name'])
print(type(a))
print(pd.DataFrame(a))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
                           0  \
0      (7654286963, Aravind)
1        (7658459658, Kiran)
2     (7788990011, Srikanth)
3         (7849569314, Yash)
4      (7854695502, Karthik)
5        (7858995995, Sunil)
6        (7889468125, Viswa)
7        (7894561256, Bhanu)
8       (7895469542, Pranav)
9       (7895525559, Nithin)
10  (7899546895, Karthikeya)
11      (8106940122, Chaitu)
12       (8456921775, Pavan)
13    (8479658997, Bhagyesh)
14     (8546297615, Dhanush)
15    (8899774455, Naga Sai)
16   (9345865744, Sai kiran)
17       (9548678954, Suraj)
18      (9554864815, Harsha)
19  (9785432158, Bharathwaj)
20       (9988776655, Subbu)

                                                    1
0      sno     Name  Age   Mobile No         Mail ...
1      sno   Name  Age   Mobile No         Mail  P...
2      sno      Name  Age   Mobile No         Mail...
3       sno  Name  Age   Mobile No         Mail  P...
4       sno     Name  Age   Mobile No         Mail...
5       sno   Name  Age   Mobile No         Mail P...
6       sno   Name  Age   Mobile No         Mail  ...
7       sno   Name  Age   Mobile No         Mail  ...
8      sno    Name  Age   Mobile No         Mail P...
9       sno    Name  Age   Mobile No         Mail ...
10      sno        Name  Age   Mobile No         M...
11     sno    Name  Age   Mobile No         Mail  ...
12     sno   Name  Age   Mobile No         Mail Pa...
13     sno      Name  Age   Mobile No         Mail...
14      sno     Name  Age   Mobile No         Mail...
15     sno      Name  Age   Mobile No         Mail...
16     sno       Name  Age   Mobile No         Mai...
17     sno   Name  Age   Mobile No         Mail Pa...
18      sno    Name  Age   Mobile No         Mail ...
19      sno        Name  Age   Mobile No         M...
20      sno   Name  Age   Mobile No         Mail  ...

In [ ]:
f=open("C:\\Users\ckund\OneDrive\Desktop\data.txt", "r")
print(f.read())

Chaitanya Prasad

In [ ]:
f=open("C:\\Users\ckund\OneDrive\Desktop\data.txt", "r")
print(f.read(3))

Cha

In [ ]:
f=open("C:\\Users\ckund\OneDrive\Desktop\data.txt", "r")
print(f.readline())

Chaitanya Prasad

In [ ]:
f=open("C:\\Users\ckund\OneDrive\Desktop\data.txt", "w")
print(f.write("I am in Btech"))
f.close()
f = open("C:\\Users\ckund\OneDrive\Desktop\data.txt", "r")
print(f.read())

13
I am in Btech

In [ ]:
f = open("C:\\Users\ckund\OneDrive\Desktop\chaitu.txt","r")
df=f.read().replace(" ","")
print(df)
print(len(df))

HelloChaituThisisChaituThisisChaituThisisChaituThisisChaitu
59

In [ ]:
f = open("C:\\Users\ckund\OneDrive\Desktop\chaitu.txt","r")
df=f.read()
print(df)
print(len(df))

Hello ChaituThis is ChaituThis is ChaituThis is ChaituThis is Chaitu
68

In [ ]:
f = open("C:\\Users\ckund\OneDrive\Desktop\chaitu.txt","a")
f.write("This is Chaitu")
f.close()
f = open("C:\\Users\ckund\OneDrive\Desktop\chaitu.txt","r")
df = f.read()
print(df)
print(len(df))

Hello ChaituThis is ChaituThis is ChaituThis is ChaituThis is ChaituThis is Chaitu
82